In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
##object creation
s=pd.Series([0,1,'w',2,2,3,4,5,np.nan])
print s[8]
print s

nan
0      0
1      1
2      w
3      2
4      2
5      3
6      4
7      5
8    NaN
dtype: object

In [3]:
##creating Frame object
dates=pd.date_range('20130101',periods=8)
print dates[0]
df=pd.DataFrame(np.random.randn(8,4),index=dates,columns=list("abcd"))
print df

2013-01-01 00:00:00
                   a         b         c         d
2013-01-01  0.534172  0.393961  1.748737 -1.749692
2013-01-02 -0.078022  1.145802 -1.121466 -0.247243
2013-01-03  1.141185  0.494015 -0.367961  0.941941
2013-01-04 -0.682868 -1.663265 -1.282505 -1.132429
2013-01-05  0.658936  1.774453  0.250783  0.082999
2013-01-06  0.580225  0.497000 -1.522526 -0.069821
2013-01-07 -1.950423 -0.941854  0.465907 -0.359835
2013-01-08 -0.576971 -0.515351  2.337372 -0.486543

In [4]:
df2=pd.DataFrame({
        "A":1,
        "B":2,
        "C":range(4),
        "D":[1,2,2,2]
    })
print df2

   A  B  C  D
0  1  2  0  1
1  1  2  1  2
2  1  2  2  2
3  1  2  3  2

In [5]:
df.<TAB>

SyntaxError: invalid syntax (<ipython-input-5-8b5fccb86f33>, line 1)

In [ ]:
%config IPCompleter.greedy=True

In [ ]:
df.head()

In [ ]:
df.tail()

In [ ]:
print df.index
print df.columns
print df.values
print df2.describe()

In [ ]:
##transpose
print df2.T

In [ ]:
df2.sort_index(axis=1,ascending=False)

In [ ]:
df2.sort_values(by="C",ascending=False)

In [ ]:
##selection
print df2["A"]

In [ ]:
df2[0:3]

In [ ]:
df[0:2]

In [ ]:
df[dates[0]:dates[3]]

In [ ]:
df.loc[dates[0]]

In [ ]:
df.loc[dates[0]:dates[3],['a','b','d']]

In [ ]:
df.loc[dates[0],'a']
df.at[dates[0],'a']

In [ ]:
##using ilocation
df.iloc[0:3,1:3]

In [ ]:
df.iloc[0,0]

In [ ]:
df.iloc[[0,2,3],[1,2,3]]

In [ ]:
print df2

In [ ]:
table=pd.pivot_table(df2,index=['A','D'])
print table

In [ ]:
pd.pivot_table(df2,index=['C','D'],values=['A'])

In [ ]:
pd.pivot_table(df2,index=['D','C'])

In [ ]:
df2

In [ ]:
df3=pd.DataFrame({
        'A':['a','b','b','a'],
        'B':np.array(range(4))*2,
        'C':['ch','bh','ch','ch'],
        'D':np.linspace(3,10,4)
    })

In [ ]:
df3

In [ ]:
pd.pivot_table(df3,index=['A','C'],values=['B','D'],aggfunc={'B':np.sum,'D':np.mean})

In [ ]:
def func(x):
    print x

In [ ]:
pd.pivot_table(df3,index=['A','C'],values=['B','D'],aggfunc=[np.mean,np.sum,lambda x:x.sum()-2,len])

In [ ]:
pd.pivot_table(df3,index=['A'],values=['C'],aggfunc=lambda x:x.map({'ch':1,'bh':0}).mean())

In [ ]:
a=pd.Series(['a','a','b','b'])
print a.map({'a':0,'b':1}).value_counts()
type(a.value_counts())
print a.value_counts()

In [ ]:
for i in range(len(a)):
    a.iloc[i]=a.iloc[i]*2

In [6]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['infantry', 'infantry', 'cavalry', 'cavalry', 'infantry', 'infantry', 'cavalry', 'cavalry','infantry', 'infantry', 'cavalry', 'cavalry'], 
        'experience': ['veteran', 'rookie', 'veteran', 'rookie', 'veteran', 'rookie', 'veteran', 'rookie','veteran', 'rookie', 'veteran', 'rookie'],
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

In [9]:
df=pd.DataFrame(raw_data,columns=['regiment','company','experience','name','preTestScore','postTestScore'])

In [10]:
df.head()

     regiment   company experience      name  preTestScore  postTestScore
0  Nighthawks  infantry    veteran    Miller             4             25
1  Nighthawks  infantry     rookie  Jacobson            24             94
2  Nighthawks   cavalry    veteran       Ali            31             57
3  Nighthawks   cavalry     rookie    Milner             2             62
4    Dragoons  infantry    veteran     Cooze             3             70

In [11]:
df['regiment'].value_counts()

Scouts        4
Nighthawks    4
Dragoons      4
Name: regiment, dtype: int64

In [12]:
df['company'].value_counts()

infantry    6
cavalry     6
Name: company, dtype: int64

In [13]:
df['experience'].value_counts()

rookie     6
veteran    6
Name: experience, dtype: int64

In [14]:
df['name'].value_counts()

Ali         2
Jacobson    1
Piger       1
Miller      1
Sloan       1
Milner      1
Riani       1
Ryaner      1
Jacon       1
Sone        1
Cooze       1
Name: name, dtype: int64

In [15]:
df

      regiment   company experience      name  preTestScore  postTestScore
0   Nighthawks  infantry    veteran    Miller             4             25
1   Nighthawks  infantry     rookie  Jacobson            24             94
2   Nighthawks   cavalry    veteran       Ali            31             57
3   Nighthawks   cavalry     rookie    Milner             2             62
4     Dragoons  infantry    veteran     Cooze             3             70
5     Dragoons  infantry     rookie     Jacon             4             25
6     Dragoons   cavalry    veteran    Ryaner            24             94
7     Dragoons   cavalry     rookie      Sone            31             57
8       Scouts  infantry    veteran     Sloan             2             62
9       Scouts  infantry     rookie     Piger             3             70
10      Scouts   cavalry    veteran     Riani             2             62
11      Scouts   cavalry     rookie       Ali             3             70

In [25]:
a=pd.crosstab(df.regiment,df.company,margins=True)

In [26]:
a

company     cavalry  infantry  All
regiment
Dragoons          2         2    4
Nighthawks        2         2    4
Scouts            2         2    4
All               6         6   12

In [19]:
a.columns

Index([u'cavalry', u'infantry'], dtype='object', name=u'company')

In [21]:
df.company.value_counts()

infantry    6
cavalry     6
Name: company, dtype: int64

In [22]:
a.index

Index([u'Dragoons', u'Nighthawks', u'Scouts'], dtype='object', name=u'regiment')

In [24]:
a

company     cavalry  infantry
regiment
Dragoons          2         2
Nighthawks        2         2
Scouts            2         2